MikroElektronika/mikrosdk_v2/targets/arm/mikroe/stm32/src/tim/implementation_1/hal_ll_tim.c
    uint8_t index;
    uint16_t pin_check_result;

    if ( ( pin_check_result = _hal_ll_tim_check_pin( pin, &index, handle_map ) ) == HAL_LL_PIN_NC ) {
        return HAL_LL_TIM_WRONG_PIN;
    }

    if ( hal_ll_tim_hw_specifics_map[ pin_check_result ].config.pin != pin ){
        // Clear previous module alternate functions only for pins on different ports.
        // This way we ensure the use of channels on the same modul (always on the same port),
        // but clear alternate functions it the same module is used on a different port, i.e.
        // TIM4 channel 1 can be on PB6 but also on PD12.
        if (hal_ll_gpio_port_index(hal_ll_tim_hw_specifics_map[ pin_check_result ].config.pin) != hal_ll_gpio_port_index(pin)) {
            _hal_ll_tim_alternate_functions_set_state( &hal_ll_tim_hw_specifics_map[ pin_check_result ], false );
        }

        _hal_ll_tim_map_pin( pin_check_result, index );

        _hal_ll_tim_alternate_functions_set_state( &hal_ll_tim_hw_specifics_map[ pin_check_result ], true );

        if (!handle_map[ pin_check_result ].init_ll_state) {
            handle_map[ pin_check_result ].init_ll_state = false;
            hal_ll_module_state[ pin_check_result ].init_ll_state = false;
        }
    }

    *hal_module_id = pin_check_result;

    hal_ll_module_state[ pin_check_result ].hal_ll_tim_handle = ( handle_t * )&hal_ll_tim_hw_specifics_map[ pin_check_result ].base;

    handle_map[ pin_check_result ].hal_ll_tim_handle = ( handle_t *)&hal_ll_module_state[ pin_check_result ].hal_ll_tim_handle;

    return HAL_LL_TIM_SUCCESS;
}

hal_ll_err_t hal_ll_module_configure_tim( handle_t *handle ) {
    hal_ll_tim_hw_specifics_map_local = hal_ll_get_specifics( hal_ll_tim_get_module_state_address );
    hal_ll_tim_handle_register_t *hal_handle = (hal_ll_tim_handle_register_t *)*handle;
    uint8_t pin_check_result = hal_ll_tim_hw_specifics_map_local->module_index;

    _hal_ll_tim_init( hal_ll_tim_hw_specifics_map_local );

    hal_ll_module_state[ pin_check_result ].hal_ll_tim_handle = (handle_t *)&hal_ll_tim_hw_specifics_map[ pin_check_result ].base;
    hal_ll_module_state[ pin_check_result ].init_ll_state = true;
    hal_handle->init_ll_state = true;

    return HAL_LL_TIM_SUCCESS;
}

uint32_t hal_ll_tim_set_freq( handle_t *handle, uint32_t freq_hz ) {

    uint32_t tmp_channel;

    low_level_handle = hal_ll_tim_get_handle;
    hal_ll_tim_hw_specifics_map_local = hal_ll_get_specifics( hal_ll_tim_get_module_state_address );

    hal_ll_tim_base_handle_t *hal_ll_hw_reg = hal_ll_tim_get_base_struct( hal_ll_tim_hw_specifics_map_local->base );

    low_level_handle->init_ll_state = false;

    tmp_channel = hal_ll_tim_hw_specifics_map_local->config.channel;

    // If complementary output channel is used.
    if ( HAL_LL_TIM_IS_COMPLEMENTARY ) {
        // Stop capture/compare.
        hal_ll_hw_reg->ccer &= 1UL << tmp_channel * 4 + 2;
    } else {
        // Stop capture/compare.
        hal_ll_hw_reg->ccer &= 1UL << tmp_channel * 4;
    }

    // Set TIM duty to 0.
    *( &hal_ll_hw_reg->ccr1 + hal_ll_tim_channel_static( tmp_channel ) ) = 0;

    hal_ll_tim_hw_specifics_map_local->freq_hz = freq_hz;

    _hal_ll_tim_init( hal_ll_tim_hw_specifics_map_local );

    low_level_handle->init_ll_state = true;

    return freq_hz;
}

hal_ll_err_t hal_ll_tim_set_duty( handle_t *handle, float duty_ratio ) {

    float    tmp_duty;
    uint32_t max_duty = 0;
    uint16_t max_period;

    low_level_handle = hal_ll_tim_get_handle;
    hal_ll_tim_hw_specifics_map_local = hal_ll_get_specifics( hal_ll_tim_get_module_state_address );

    hal_ll_tim_base_handle_t *hal_ll_hw_reg = hal_ll_tim_get_base_struct( hal_ll_tim_hw_specifics_map_local->base );

    if ( low_level_handle->init_ll_state == false ) {
        hal_ll_tim_start( handle );
        low_level_handle->init_ll_state = true;
    }

    tmp_duty = duty_ratio * 100;
    max_period = hal_ll_tim_hw_specifics_map_local->max_period;

    max_duty = ( ( float )max_period / 100 ) * tmp_duty;

    *( &hal_ll_hw_reg->ccr1 + hal_ll_tim_channel_static( hal_ll_tim_hw_specifics_map_local->config.channel ) ) = max_duty;

    return HAL_LL_TIM_SUCCESS;
}

hal_ll_err_t hal_ll_tim_start( handle_t *handle ) {

    uint32_t tmp_channel;
    volatile uint32_t  tmp,
                       *tmpPtr;

    low_level_handle = hal_ll_tim_get_handle;
    hal_ll_tim_hw_specifics_map_local = hal_ll_get_specifics( hal_ll_tim_get_module_state_address );

    hal_ll_tim_base_handle_t *hal_ll_hw_reg = hal_ll_tim_get_base_struct( hal_ll_tim_hw_specifics_map_local->base );

    tmp_channel = hal_ll_tim_hw_specifics_map_local->config.channel;

    // Capture/Compare 1 output enable.
    tmp = hal_ll_hw_reg->ccer;

    // If complementary output channel is used.
    if ( HAL_LL_TIM_IS_COMPLEMENTARY ) {
        // Capture/Compare complementary output enable
        tmp |=  ( 1UL << ( hal_ll_tim_channel_static( tmp_channel ) * 4 + 2 ) );
        // Capture/Compare complementary output polarity(ACTIVE HIGH).
        tmp &= ~( 1UL << ( hal_ll_tim_channel_static( tmp_channel ) * 4 + 3 ) );
    } else {
        // Capture/Compare output polarity.
        tmp |=  ( 1UL << ( hal_ll_tim_channel_static( tmp_channel ) * 4 ) );
        // Capture/Compare output polarity(ACTIVE HIGH).
        tmp &= ~( 1UL << ( hal_ll_tim_channel_static( tmp_channel ) * 4 + 1 ) );
    }

    hal_ll_hw_reg->ccer = tmp;

    #if defined(TIM_MODULE_1) || defined(TIM_MODULE_8) || defined(TIM_MODULE_20)
    // Main output enabled.
    set_reg_bit( &hal_ll_hw_reg->bdtr, HAL_LL_TIM_BDTR_MOE_BIT );
    #endif

    tmpPtr = &hal_ll_hw_reg->ccmr1;

    if( hal_ll_tim_channel_static( tmp_channel ) > 1 ) {
        tmpPtr = &hal_ll_hw_reg->ccmr2;
    }

    if( ( hal_ll_tim_channel_static( tmp_channel ) / 2 ) * 2 !=
          hal_ll_tim_channel_static( tmp_channel ) ) {
        // Clear CCxS, OCxM[0].
        *tmpPtr &= ~( HAL_LL_TIM_CCMR_CC2S_BIT0 |
                      HAL_LL_TIM_CCMR_CC2S_BIT1 |
                      HAL_LL_TIM_CCMR_OC2PE |
                      HAL_LL_TIM_CCMR_OC2M_BIT0 );
        // Set OCxM[2, 1]
        *tmpPtr |= HAL_LL_TIM_CCMR_OC2M_BIT1 | HAL_LL_TIM_CCMR_OC2M_BIT2;
    } else {
        // Clear CCxS, OCxM[0].
        *tmpPtr &= ~( HAL_LL_TIM_CCMR_CC3S_BIT0 |
                      HAL_LL_TIM_CCMR_CC3S_BIT1 |
                      HAL_LL_TIM_CCMR_OC3PE |
                      HAL_LL_TIM_CCMR_OC3M_BIT0 );

