MikroElektronika/mikrosdk_v2/targets/arm/mikroe/stm32/src/tim/implementation_1/hal_ll_tim.c
        // Set OCxM[2, 1].
        *tmpPtr |=  HAL_LL_TIM_CCMR_OC3M_BIT1 | HAL_LL_TIM_CCMR_OC3M_BIT2;
    }

    // Enable counter.
    set_reg_bit( &hal_ll_hw_reg->cr1, HAL_LL_TIM_ENABLE_COUNTER_BIT );

    return HAL_LL_TIM_SUCCESS;
}

hal_ll_err_t hal_ll_tim_stop( handle_t *handle ) {

    low_level_handle = hal_ll_tim_get_handle;
    hal_ll_tim_hw_specifics_map_local = hal_ll_get_specifics( hal_ll_tim_get_module_state_address );

    hal_ll_tim_base_handle_t *hal_ll_hw_reg = hal_ll_tim_get_base_struct( hal_ll_tim_hw_specifics_map_local->base );

    // If complementary output channel is used.
    if ( HAL_LL_TIM_IS_COMPLEMENTARY ) {
        hal_ll_hw_reg->ccer &= 1UL << hal_ll_tim_hw_specifics_map_local->config.channel * 4 + 2;
    } else {
        hal_ll_hw_reg->ccer &= 1UL << hal_ll_tim_hw_specifics_map_local->config.channel * 4;
    }

    return HAL_LL_TIM_SUCCESS;
}

void hal_ll_tim_close( handle_t *handle ) {

    low_level_handle = hal_ll_tim_get_handle;
    hal_ll_tim_hw_specifics_map_local = hal_ll_get_specifics(hal_ll_tim_get_module_state_address);

    if( low_level_handle->hal_ll_tim_handle != NULL ) {
        low_level_handle->hal_ll_tim_handle = NULL;
        low_level_handle->hal_drv_tim_handle = NULL;

        low_level_handle->init_ll_state = false;

        hal_ll_tim_hw_specifics_map_local->max_period = 0;
        hal_ll_tim_hw_specifics_map_local->freq_hz = 0;

        _hal_ll_tim_set_clock( hal_ll_tim_hw_specifics_map_local->base, true );
        _hal_ll_tim_alternate_functions_set_state( hal_ll_tim_hw_specifics_map_local, false );
        _hal_ll_tim_set_clock( hal_ll_tim_hw_specifics_map_local->base, false );

        hal_ll_tim_hw_specifics_map_local->config.pin = HAL_LL_PIN_NC;
        hal_ll_tim_hw_specifics_map_local->config.channel = HAL_LL_PIN_NC;
        hal_ll_tim_hw_specifics_map_local->config.af = NULL;
    }
}

// ----------------------------------------------- PRIVATE FUNCTION DEFINITIONS
static inline void _hal_ll_tim1_set_clock( bool hal_ll_state ) {
    if( hal_ll_state ) {
        set_reg_bit( _RCC_APB2ENR, HAL_LL_TIM_ENABLE_1 );
    } else {
        clear_reg_bit( _RCC_APB2ENR, HAL_LL_TIM_ENABLE_1 );
    }
}

static inline void _hal_ll_tim2_set_clock( bool hal_ll_state ) {
    #if defined(STM32H7xx)
    if( hal_ll_state ) {
        set_reg_bit( _RCC_APB1LENR, HAL_LL_TIM_ENABLE_2 );
    } else {
        clear_reg_bit( _RCC_APB1LENR, HAL_LL_TIM_ENABLE_2 );
    }
    #else
    if( hal_ll_state ) {
        set_reg_bit( _RCC_APB1ENR, HAL_LL_TIM_ENABLE_2 );
    } else {
        clear_reg_bit( _RCC_APB1ENR, HAL_LL_TIM_ENABLE_2 );
    }
    #endif
}

static inline void _hal_ll_tim3_set_clock( bool hal_ll_state ) {
    #if defined(STM32H7xx)
    if( hal_ll_state ) {
        set_reg_bit( _RCC_APB1LENR, HAL_LL_TIM_ENABLE_3 );
    } else {
        clear_reg_bit( _RCC_APB1LENR, HAL_LL_TIM_ENABLE_3 );
    }
    #else
    if( hal_ll_state ) {
        set_reg_bit( _RCC_APB1ENR, HAL_LL_TIM_ENABLE_3 );
    } else {
        clear_reg_bit( _RCC_APB1ENR, HAL_LL_TIM_ENABLE_3 );
    }
    #endif
}

static inline void _hal_ll_tim4_set_clock( bool hal_ll_state ) {
    #if defined(STM32H7xx)
    if( hal_ll_state ) {
        set_reg_bit( _RCC_APB1LENR, HAL_LL_TIM_ENABLE_4 );
    } else {
        clear_reg_bit( _RCC_APB1LENR, HAL_LL_TIM_ENABLE_4 );
    }
    #else
    if( hal_ll_state ) {
        set_reg_bit( _RCC_APB1ENR, HAL_LL_TIM_ENABLE_4 );
    } else {
        clear_reg_bit( _RCC_APB1ENR, HAL_LL_TIM_ENABLE_4 );
    }
    #endif
}

static inline void _hal_ll_tim5_set_clock( bool hal_ll_state ) {
    #if defined(STM32H7xx)
    if( hal_ll_state ) {
        set_reg_bit( _RCC_APB1LENR, HAL_LL_TIM_ENABLE_5 );
    } else {
        clear_reg_bit( _RCC_APB1LENR, HAL_LL_TIM_ENABLE_5 );
    }
    #else
    if( hal_ll_state ) {
        set_reg_bit( _RCC_APB1ENR, HAL_LL_TIM_ENABLE_5 );
    } else {
        clear_reg_bit( _RCC_APB1ENR, HAL_LL_TIM_ENABLE_5 );
    }
    #endif
}

static inline void _hal_ll_tim8_set_clock( bool hal_ll_state ) {
    if( hal_ll_state ) {
        set_reg_bit( _RCC_APB2ENR, HAL_LL_TIM_ENABLE_8 );
    } else {
        clear_reg_bit( _RCC_APB2ENR, HAL_LL_TIM_ENABLE_8 );
    }
}

static inline void _hal_ll_tim9_set_clock( bool hal_ll_state ) {
    if( hal_ll_state ) {
        set_reg_bit( _RCC_APB2ENR, HAL_LL_TIM_ENABLE_9 );
    } else {
        clear_reg_bit( _RCC_APB2ENR, HAL_LL_TIM_ENABLE_9 );
    }
}

static inline void _hal_ll_tim10_set_clock( bool hal_ll_state ) {
    if( hal_ll_state ) {
        set_reg_bit( _RCC_APB2ENR, HAL_LL_TIM_ENABLE_10 );
    } else {
        clear_reg_bit( _RCC_APB2ENR, HAL_LL_TIM_ENABLE_10 );
    }
}

static inline void _hal_ll_tim11_set_clock( bool hal_ll_state ) {
    if( hal_ll_state ) {
        set_reg_bit( _RCC_APB2ENR, HAL_LL_TIM_ENABLE_11 );
    } else {
        clear_reg_bit( _RCC_APB2ENR, HAL_LL_TIM_ENABLE_11 );
    }
}

static inline void _hal_ll_tim12_set_clock( bool hal_ll_state ) {
    #if defined(STM32H7xx)
    if( hal_ll_state ) {
        set_reg_bit( _RCC_APB1LENR, HAL_LL_TIM_ENABLE_12 );
    } else {
        clear_reg_bit( _RCC_APB1LENR, HAL_LL_TIM_ENABLE_12 );
    }
    #else
    if( hal_ll_state ) {
        set_reg_bit( _RCC_APB1ENR, HAL_LL_TIM_ENABLE_12 );
    } else {
        clear_reg_bit( _RCC_APB1ENR, HAL_LL_TIM_ENABLE_12 );
    }
    #endif
}

static inline void _hal_ll_tim13_set_clock( bool hal_ll_state ) {
    #if defined(STM32H7xx)
    if( hal_ll_state ) {
        set_reg_bit( _RCC_APB1LENR, HAL_LL_TIM_ENABLE_13 );
    } else {
        clear_reg_bit( _RCC_APB1LENR, HAL_LL_TIM_ENABLE_13 );
    }
    #else
    if( hal_ll_state ) {
        set_reg_bit( _RCC_APB1ENR, HAL_LL_TIM_ENABLE_13 );
    } else {
        clear_reg_bit( _RCC_APB1ENR, HAL_LL_TIM_ENABLE_13 );
    }
    #endif
}

static inline void _hal_ll_tim14_set_clock( bool hal_ll_state ) {
    #if defined(STM32H7xx)
    if( hal_ll_state ) {
        set_reg_bit( _RCC_APB1LENR, HAL_LL_TIM_ENABLE_14 );
    } else {
        clear_reg_bit( _RCC_APB1LENR, HAL_LL_TIM_ENABLE_14 );
    }
    #else
    if( hal_ll_state ) {
        set_reg_bit( _RCC_APB1ENR, HAL_LL_TIM_ENABLE_14 );
    } else {
        clear_reg_bit( _RCC_APB1ENR, HAL_LL_TIM_ENABLE_14 );
    }
    #endif
}

static inline void _hal_ll_tim15_set_clock( bool hal_ll_state ) {
    if( hal_ll_state ) {
        set_reg_bit( _RCC_APB2ENR, HAL_LL_TIM_ENABLE_15 );
    } else {
        clear_reg_bit( _RCC_APB2ENR, HAL_LL_TIM_ENABLE_15 );
    }
}

static inline void _hal_ll_tim16_set_clock( bool hal_ll_state ) {
    if( hal_ll_state ) {
        set_reg_bit( _RCC_APB2ENR, HAL_LL_TIM_ENABLE_16 );
    } else {
        clear_reg_bit( _RCC_APB2ENR, HAL_LL_TIM_ENABLE_16 );
    }
}

static inline void _hal_ll_tim17_set_clock( bool hal_ll_state ) {
    if( hal_ll_state ) {
        set_reg_bit( _RCC_APB2ENR, HAL_LL_TIM_ENABLE_17 );
    } else {
        clear_reg_bit( _RCC_APB2ENR, HAL_LL_TIM_ENABLE_17 );
    }
}

