MikroElektronika/mikrosdk_v2/targets/arm/mikroe/stm32/src/tim/implementation_1/hal_ll_tim.c
    uint8_t tmp_channel;

    // Map new pin
    hal_ll_tim_hw_specifics_map[ module_index ].config.pin = _tim_map[ index ].pin;
    tmp_channel = _tim_map[ index ].channel;
    hal_ll_tim_hw_specifics_map[ module_index ].config.af = _tim_map[ index ].af;

    if ( tmp_channel >= HAL_LL_TIM_CHANNEL_1N ) {
        HAL_LL_TIM_IS_COMPLEMENTARY = true;
        hal_ll_tim_hw_specifics_map[ module_index ].config.channel = tmp_channel - 4;
    } else {
        HAL_LL_TIM_IS_COMPLEMENTARY = false;
        hal_ll_tim_hw_specifics_map[ module_index ].config.channel = tmp_channel;
    }
}

static void _hal_ll_tim_alternate_functions_set_state( hal_ll_tim_hw_specifics_map_t *map, bool hal_ll_state ) {

    module_struct module;
    uint32_t      tim_config = 0;

    if( map->config.pin != HAL_LL_PIN_NC ) {
        if( hal_ll_state == false ) {
            tim_config = GPIO_CFG_MODE_ALT_FUNCTION |
                         GPIO_CFG_SPEED_LOW |
                         GPIO_CFG_OTYPE_PP;
        } else {
            tim_config = GPIO_CFG_MODE_ALT_FUNCTION |
                         GPIO_CFG_SPEED_HIGH |
                         GPIO_CFG_OTYPE_PP;
        }

        module.pins[ 0 ] = VALUE( map->config.pin, map->config.af );
        module.pins[ 1 ] = GPIO_MODULE_STRUCT_END;

        module.configs[ 0 ] = tim_config;
        module.configs[ 1 ] = GPIO_MODULE_STRUCT_END;

        hal_ll_gpio_module_struct_init( &module, hal_ll_state );
    }
}

static void _hal_ll_tim_hw_init( hal_ll_tim_hw_specifics_map_t *map )
{
    uint32_t psc;
    uint32_t arr;
    uint32_t tim_clk;

    hal_ll_tim_base_handle_t *hal_ll_hw_reg = hal_ll_tim_get_base_struct( map->base );

    /* Upcounter */
    clear_reg_bit( &hal_ll_hw_reg->cr1, HAL_LL_TIM_CR1_DIR_BIT );

    /* Timer input clock */
    tim_clk = _hal_ll_tim_get_clock_speed( map->base );

    uint32_t prescaler = 0;
    uint32_t period    = 0;
    uint32_t ticks     = tim_clk / map->freq_hz;

    prescaler = ( ticks / (UINT16_MAX + 1ul) );
    if ( prescaler > UINT16_MAX ) {
        prescaler = UINT16_MAX;
        map->freq_hz = tim_clk;
    }

    period = ( ticks / ( prescaler + 1 ) ) - 1;
    if ( period > UINT16_MAX )
        period = UINT16_MAX;

    hal_ll_hw_reg->psc = (uint16_t)prescaler;
    hal_ll_hw_reg->arr = (uint16_t)period;
    map->max_period    = (uint16_t)period;
}

static void _hal_ll_tim_init( hal_ll_tim_hw_specifics_map_t *map ) {

    _hal_ll_tim_set_clock( map->base, true );

    _hal_ll_tim_alternate_functions_set_state( map, true );

    _hal_ll_tim_hw_init( map );
}
// ------------------------------------------------------------------------- END
